import random
dict_famous = {
    "Иван1": "01.01.2001",
    "Иван2": "02.02.2001",
    "Иван3": "03.03.2001",
    "Иван4": "04.04.2001",
    "Иван5": "05.05.2001",
    "Иван6": "06.06.2001",
    "Иван7": "07.07.2001",
    "Иван8": "08.08.2001",
    "Иван9": "09.11.2001",
    "Иван10": "10.12.2001"
}
days = {
    "01": "Первое",
    "02": "Второе",
    "03": "Третье",
    "04": "Четвертое",
    "05": "Пятое",
    "06": "Шестое",
    "07": "Седьмое",
    "08": "Восьмое",
    "09": "Девятое",
    "10": "Десятое"
}
months = {
    "01": "Января",
    "02": "Февраля",
    "03": "Марта",
    "04": "Апреля",
    "05": "Мая",
    "06": "Июня",
    "07": "Июля",
    "08": "Августа",
    "09": "Сентября",
    "10": "Октября",
    "11": "Ноября",
    "12": "Декабря"
}
length_list = 5
list_famous = random.sample(["Иван1", "Иван2", "Иван3", "Иван4", "Иван5", "Иван6", "Иван7", "Иван8", "Иван9", "Иван10"], length_list)
print(list_famous)

count_true = 0
for i in range(length_list):
    answer = input(f"Введите год рождения {list_famous[i]}: ")
    if answer == dict_famous[list_famous[i]]:
        day = days[answer[:2]]
        month = months[answer[3:5]]
        print(f"Верно, год рождения {day} {month} {answer[6:]} года" )
        count_true += 1
    else:
        print("Не верно")
print("Количество правильных ответов -", count_true)
print("Количество ошибок -", length_list - count_true)
print("Процент правильных ответов  -", count_true/length_list*100)
print("Процент неправильных ответов  -", 100 - count_true/length_list*100)
